---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening
source: html/3f46223e-c947-a1c4-9a78-5645d2684c19.htm
---
# EnergyAnalysisOpening Properties

The id of the assembly instance to which the element belongs.